CF/Catalogs/СкидкиНаценки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>СкидкиНаценки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаПредоставления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантСовместногоПрименения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыСовместногоПримененияСкидокНаценок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеСкидкиНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбластьПредоставления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОбластейОграниченияСкидокНаценок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СегментНоменклатурыПредоставления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПредоставления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПредоставленияСкидокНаценок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДействия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДействияСкидок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Управляемая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодарокИзСписка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодарокИзКорзиныПокупателя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПодарковИзКорзиныПокупателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьПодарокКакПродажу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоментВыдачиСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТочкиВыдачиСообщенияКассиру</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БонуснаяПрограммаЛояльности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БонусныеПрограммыЛояльности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДействия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПериодовДействия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОтсрочкиНачалаДействия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПериодовОтсрочкиНачалаДействия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратноКоличествуУсловий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеРазмераПодчиненныхСкидок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыВнешнейОбработки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УсловияПредоставления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УсловиеПредоставления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УсловияПредоставленияСкидокНаценок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЦеновыеГруппы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦеноваяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеСкидкиНаценки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборПодарков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CF/Enums/СпособыПредоставленияСкидокНаценок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СпособыПредоставленияСкидокНаценок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сумма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Процент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидЦены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подарок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сообщение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапретРозничнойПродажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентОтСуммыПредыдущейПокупки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоБонусныхБаллов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентОтСуммыВВидеБонусныхБаллов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешняяОбработка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CF/Enums/УсловияПредоставленияСкидокНаценок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>УсловияПредоставленияСкидокНаценок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаРазовыйОбъемПродаж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаНакопленныйОбъемПродаж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаПробнуюПродажу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаПервуюПродажуПартнеру</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаВремяПродажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаГрафикОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаФормуОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОграничениеПоГруппеПользователей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаКомплектПокупки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВДеньРождения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПорядковыйНомерПродажиКратен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоТипуПолучателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешняяОбработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольноеУсловиеССКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдноразовыйКод</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CF/Enums/ВариантОпределенияПериодаНакопительнойСкидки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВариантОпределенияПериодаНакопительнойСкидки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПрошлыйПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрошлыйСкользящийПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СНачалаТекущегоПериода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесьПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредыдущаяПокупка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CF/Enums/ВариантыОбластейОграниченияСкидокНаценок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВариантыОбластейОграниченияСкидокНаценок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВДокументе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВСтроке</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CF/Catalogs/СкидкиНаценки/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	Если ЭтоГруппа Тогда
		Если НЕ ОграничениеРазмераПодчиненныхСкидок Тогда
			МассивНепроверяемыхРеквизитов.Добавить("СпособПредоставления");	
			МассивНепроверяемыхРеквизитов.Добавить("ЗначениеСкидкиНаценки");
		КонецЕсли;
	Иначе
	
		Если СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.КоличествоБонусныхБаллов
			ИЛИ СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.ПроцентОтСуммыВВидеБонусныхБаллов Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ВариантСовместногоПрименения");
			МассивНепроверяемыхРеквизитов.Добавить("ВидЦены");
			МассивНепроверяемыхРеквизитов.Добавить("ОбластьПредоставления");
			МассивНепроверяемыхРеквизитов.Добавить("КоличествоПодарковИзКорзиныПокупателя");
			МассивНепроверяемыхРеквизитов.Добавить("ТекстСообщения");
			МассивНепроверяемыхРеквизитов.Добавить("МоментВыдачиСообщения");
			МассивНепроверяемыхРеквизитов.Добавить("ЦеновыеГруппы.ЦеноваяГруппа");
			МассивНепроверяемыхРеквизитов.Добавить("НаборПодарков");
			МассивНепроверяемыхРеквизитов.Добавить("НаборПодарков.Номенклатура");
			МассивНепроверяемыхРеквизитов.Добавить("НаборПодарков.Характеристика");
			МассивНепроверяемыхРеквизитов.Добавить("НаборПодарков.КоличествоУпаковок");
			МассивНепроверяемыхРеквизитов.Добавить("НаборПодарков.Количество");
			Если КоличествоПериодовДействия = 0 Тогда
				МассивНепроверяемыхРеквизитов.Добавить("ПериодДействия");
			КонецЕсли;
			Если КоличествоПериодовОтсрочкиНачалаДействия = 0 Тогда
				МассивНепроверяемыхРеквизитов.Добавить("ПериодОтсрочкиНачалаДействия");
			КонецЕсли;
			
			
		Иначе
			МассивНепроверяемыхРеквизитов.Добавить("БонуснаяПрограммаЛояльности");
			МассивНепроверяемыхРеквизитов.Добавить("ПериодДействия");
			МассивНепроверяемыхРеквизитов.Добавить("ПериодОтсрочкиНачалаДействия");
			
			Если СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.Сообщение 
				ИЛИ СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.Подарок Тогда
				МассивНепроверяемыхРеквизитов.Добавить("ОбластьПредоставления");
				МассивНепроверяемыхРеквизитов.Добавить("ЗначениеСкидкиНаценки");
			КонецЕсли;
			
			Если СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.ВидЦены Тогда
				МассивНепроверяемыхРеквизитов.Добавить("ЗначениеСкидкиНаценки");
			Иначе
				МассивНепроверяемыхРеквизитов.Добавить("ВидЦены");
			КонецЕсли;
			
			ИспользуютсяВалюты = ЦенообразованиеПереопределяемый.ИспользуютсяВалюты(); 
			
			Если    НЕ СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.Сумма 
				ИЛИ НЕ ИспользуютсяВалюты Тогда
				МассивНепроверяемыхРеквизитов.Добавить("ВалютаПредоставления");
			КонецЕсли;
			
			Если СпособПредоставления <> Перечисления.СпособыПредоставленияСкидокНаценок.Подарок 
				ИЛИ ПодарокИзКорзиныПокупателя Тогда
				МассивНепроверяемыхРеквизитов.Добавить("НаборПодарков");
				МассивНепроверяемыхРеквизитов.Добавить("НаборПодарков.Номенклатура");
				МассивНепроверяемыхРеквизитов.Добавить("НаборПодарков.Количество");
				МассивНепроверяемыхРеквизитов.Добавить("НаборПодарков.КоличествоУпаковок");
				МассивНепроверяемыхРеквизитов.Добавить("НаборПодарков.Характеристика");
			Иначе		
				МассивНепроверяемыхРеквизитов.Добавить("НаборПодарков.Характеристика");
				ОбработкаТабличнойЧастиТоварыСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект, Новый Массив, Отказ, Новый Структура("ИмяТЧ","НаборПодарков"));	
			КонецЕсли;
			
			Если НЕ ПодарокИзКорзиныПокупателя ИЛИ СпособПредоставления <> Перечисления.СпособыПредоставленияСкидокНаценок.Подарок Тогда
				МассивНепроверяемыхРеквизитов.Добавить("КоличествоПодарковИзКорзиныПокупателя");
			КонецЕсли;
			
			Если СпособПредоставления <> Перечисления.СпособыПредоставленияСкидокНаценок.Сообщение Тогда
				МассивНепроверяемыхРеквизитов.Добавить("ТекстСообщения");
				МассивНепроверяемыхРеквизитов.Добавить("МоментВыдачиСообщения");
			КонецЕсли;
			
			Если СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.ПроцентОтСуммыПредыдущейПокупки Тогда
				УсловиеНайдено = Ложь;
				Для Каждого СтрокаУсловия Из УсловияПредоставления Цикл
					ДанныеУсловия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаУсловия.УсловиеПредоставления,
																				"ВариантОпределенияПериодаНакопительнойСкидки, УсловиеПредоставления");
					Если ДанныеУсловия.УсловиеПредоставления = Перечисления.УсловияПредоставленияСкидокНаценок.ЗаНакопленныйОбъемПродаж
						И ДанныеУсловия.ВариантОпределенияПериодаНакопительнойСкидки = Перечисления.ВариантОпределенияПериодаНакопительнойСкидки.ПредыдущаяПокупка Тогда
						УсловиеНайдено = Истина;
					КонецЕсли;
				КонецЦикла;
				Если НЕ УсловиеНайдено Тогда
					Отказ = Истина;
					ТекстСообщения = НСтр("ru = 'Для использования скидки ""%1"" необходимо выбрать условие ""За накопленный объем продаж за предыдущую покупку"".'");
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СпособПредоставления);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					ТекстСообщения,
					ЭтотОбъект,
					"УсловияПредоставления",
					,
					Ложь);
				КонецЕсли;
			ИначеЕсли СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.ЗапретРозничнойПродажи Тогда
				
				МассивНепроверяемыхРеквизитов.Добавить("ЗначениеСкидкиНаценки");
				
				Если НЕ ЗначениеЗаполнено(СегментНоменклатурыПредоставления) Тогда
					ТекстСообщения = НСтр("ru='Не указан сегмент номенклатуры предоставления'");
					Отказ = Истина;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					ТекстСообщения,
					ЭтотОбъект,
					"СегментНоменклатурыПредоставления",
					,
					Истина);
				КонецЕсли;
				
				ТекстСообщения = "";
				Если УсловияПредоставления.Количество() = 0 Тогда
					Отказ = Истина;
					ТекстСообщения = НСтр("ru='Если не заданы временные условия, то запрет продаж не будет действовать.'");
				Иначе
					ЕстьВременноеУсловие = Ложь;
					Для Каждого СтрокаУсловия Из УсловияПредоставления Цикл
						Если СтрокаУсловия.УсловиеПредоставления.УсловиеПредоставления = Перечисления.УсловияПредоставленияСкидокНаценок.ЗаВремяПродажи Тогда
							ЕстьВременноеУсловие = Истина;
						КонецЕсли;
					КонецЦикла;
					Если НЕ ЕстьВременноеУсловие Тогда
						Отказ = Истина;
						ТекстСообщения = НСтр("ru='Если не заданы временные условия, то запрет продаж не будет действовать.'");
					КонецЕсли;
				КонецЕсли;
				Если ЗначениеЗаполнено(ТекстСообщения) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					ТекстСообщения,
					ЭтотОбъект,
					"УсловияПредоставления",
					,
					Истина);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.ВнешняяОбработка Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ЗначениеСкидкиНаценки");
	Иначе
		МассивНепроверяемыхРеквизитов.Добавить("ВнешняяОбработка");
	КонецЕсли;
	
	ЕстьОдноразовыйКод = Ложь;
	Для Каждого СтрокаУсловия Из УсловияПредоставления Цикл
		Если СтрокаУсловия.УсловиеПредоставления.УсловиеПредоставления = Перечисления.УсловияПредоставленияСкидокНаценок.ОдноразовыйКод Тогда
			ЕстьОдноразовыйКод = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ЕстьОдноразовыйКод И НЕ Управляемая Тогда
		Отказ = Истина;
		ТекстСообщения = НСтр("ru='Если задано условие по одноразовому коду, то скидка должна назначаться вручную.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстСообщения,
			ЭтотОбъект,
			"Управляемая",
			,
			Истина);
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	ОчиститьНеиспользуемыеРеквизиты();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОчиститьНеиспользуемыеРеквизиты()

	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.ВидЦены Тогда
		
		ВалютаПредоставления = Неопределено;
		ЗначениеСкидкиНаценки = Неопределено;
		
		ЦеновыеГруппы.Очистить();
		
	ИначеЕсли СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.Процент Тогда
		
		ВалютаПредоставления = Неопределено;
		ВидЦены              = Неопределено;
		
	ИначеЕсли СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.Сумма Тогда
		
		ВидЦены = Неопределено;
		
		Если ОбластьПредоставления = Перечисления.ВариантыОбластейОграниченияСкидокНаценок.ВДокументе Тогда
			
			ЦеновыеГруппы.Очистить();
			
		ИначеЕсли ОбластьПредоставления = Перечисления.ВариантыОбластейОграниченияСкидокНаценок.ВСтроке Тогда
			
			
		Иначе
			
			ЦеновыеГруппы.Очистить();
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если  СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.Подарок Тогда
	
		ВалютаПредоставления  = Неопределено;
		ЗначениеСкидкиНаценки = Неопределено;
		ВидЦены               = Неопределено;
		
		ЦеновыеГруппы.Очистить();
		
		Если ПодарокИзКорзиныПокупателя Тогда
			НаборПодарков.Очистить();
		Иначе
			КоличествоПодарковИзКорзиныПокупателя = 0;
		КонецЕсли;
	Иначе
		
		НаборПодарков.Очистить();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
